from aiogram import Router, F
from aiogram.types import CallbackQuery
from keyboards import email_menu

router = Router()

@router.callback_query(F.data == "email_invite")
async def email_invite(callback: CallbackQuery):
    # Отправка всех шаблонов в одном сообщении
    text = "\n\n".join([
        "    Здравствуйте, [Имя],\n"
        "Мы рады пригласить вас на встречу, чтобы обсудить [указать тему]. "
        "Будем рады услышать ваше мнение и обменяться идеями. "
        "Встреча состоится [дата, время, место]. Если у вас есть предпочтения по времени, пожалуйста, дайте знать.\n\n"
        "Будем ждать вашего ответа!",

        "    Уважаемый [Имя],\n"
        "Приглашаем вас на наше мероприятие, посвященное [указать тему]. "
        "Вас ждет интересная программа, возможность пообщаться с коллегами и обменяться ценным опытом. "
        "Мероприятие пройдет [дата, время, место].\n\n"
        "Будем рады вашему присутствию! Пожалуйста, подтвердите участие.",

        "    Уважаемый [Имя],\n"
        "Мы организуем встречу для обсуждения деталей нашего возможного сотрудничества. "
        "Хотим подробно обсудить [ключевые вопросы], чтобы вы могли принять обоснованное решение. "
        "Предлагаем встретиться [дата, время, место].\n\n"
        "Будем признательны за ваше подтверждение или предложение альтернативного времени."
    ])
    
    # Отправляем все шаблоны одним сообщением с кнопкой "Назад"
    await callback.message.answer(
        text,
        reply_markup=email_menu  # Клавиатура с кнопкой назад
    )
    await callback.answer()
