from aiogram import Router, F
from aiogram.types import CallbackQuery
from keyboards import email_menu

router = Router()

@router.callback_query(F.data == "email_reminder")
async def email_reminder(callback: CallbackQuery):
    # Отправка всех шаблонов в одном сообщении
    text = "\n\n".join([
        "    Добрый день, [Имя],\n"
        "Хотел бы напомнить о предстоящем дедлайне по [проекту/задаче], который намечен на [дата]. "
        "Просьба подтвердить выполнение в срок или сообщить, если необходимы изменения.\n\n"
        "Спасибо за внимание!",

        "    Уважаемый [Имя],\n"
        "Прошу подтвердить выполнение задачи [название] в установленный срок [дата]. "
        "Если возникли сложности или требуется дополнительное время, пожалуйста, дайте знать заранее.\n\n"
        "С нетерпением жду вашего ответа!",

        "    Здравствуйте, [Имя],\n"
        "Напоминаем, что встреча запланирована на [дата, время, место]. "
        "Просим подтвердить ваше участие. Если вам неудобно в указанное время, "
        "сообщите, пожалуйста, и мы подберём альтернативный вариант.\n\n"
        "Будем рады видеть вас!"
    ])
    
    # Отправляем все шаблоны одним сообщением с кнопкой "Назад"
    await callback.message.answer(
        text,
        reply_markup=email_menu  # Клавиатура с кнопкой назад
    )
    await callback.answer()
